#!/usr/bin/env bash

cask "homebrew/cask"
cask "homebrew/cask-fonts"
cask "homebrew/services"
cask "heroku/brew"

# Binaries
brew 'asdf'
brew 'bash'
brew 'bash-completion2'
brew 'coreutils'
brew 'git'
brew 'gmp'
brew 'gpg'
brew 'grep'
brew 'graphviz'
brew 'openssh'
brew 'screen'
brew 'yarn'
brew 'z'
brew 'zsh'

# CLIs
brew 'awscli'
brew 'gh'
brew 'heroku'

# Other
brew 'imagemagick'

# Applications
cask 'brave-browser'
cask 'firefox'
cask 'google-chrome'
cask 'discord'
cask 'docker'
cask 'licecap'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'telegram-desktop'
cask 'visual-studio-code'
cask 'vlc'
cask 'zoom'